// — Пароль і 4 спроби.

let count = 5,
  userPass = "pass";

while (count) {
  let tryPass = prompt("Введіть пароль");

  if (tryPass === userPass) {
    alert("Запрошуємо на сайт!");
    count = 0;
  } else {
    count--;

    if (count === 0) alert("Будь ласка спробуйте пізніше!");
    else alert(`залишилось спроб ${count}`);
  }
}

// 👉 Завдання 1:
// — Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.

let n = +prompt("Введіть натуральне число");
if (n > 0 && !(n % 1)) {
  let factorial = 1,
    count = 1;

  while (count <= n) {
    factorial *= count;
    count++;
  }

  alert(factorial);
} else alert("Введено не натуральне число");

// 👉 Завдання 2:
// — Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

let i = 1000;
while (i <= 9999) {
  document.write(`${i}, `);
  i += 3;
}

// 👉 Завдання 3:
// — Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17…

let element = 1,
  count = 1;
while (count <= 55) {
  document.write(`<p>Елемент № ${count} = ${element}<p/>`);
  element += 2;
  count++;
}

// 👉 Завдання 4:
// — Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60…

let str = "";
let i = 90;
while (i >= 0) {
  str += i + " ";
  i -= 5;
}
document.write(str);

// 👉 Завдання 5:
// — Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128…

let str = "",
  element = 2,
  count = 1;
while (count <= 20) {
  str += element + " ";
  element *= 2;
  count++;
}
document.write(str);

// 👉 Завдання 6:
// — Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), де початкове значення a = 2 та які менше 10000.

let str = "",
  a = 2;
while (a < 10000) {
  str += a + " ";
  a = 2 * a - 1;
}
document.write(str);

// 👉 Завдання 7:
// — Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника),
//де початкове значення змінної a = -166.

let str = "",
  a = -166;
while (a < 100) {
  if (a > -100) str += a + " ";
  a = 2 * a + 200;
}
document.write(str);

// 👉 Завдання 8:
// — Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0. Обрахувати всі можливі варіанти циклом for. Задачу бажано виконати використовуючи 1 цикл!
// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1; */

let a = +prompt("Введіть число"),
  b = +prompt("Введіть степінь"),
  result = 1,
  condition = b;

if (b < 0) condition = -b;

while (condition) {
  result *= a;
  condition--;
  if (b < 0 && !condition) result = 1 / result;
}
console.log(result);
