// 👉 Завдання 1:
// — Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.

let n = +prompt("Введіть натуральне число");
if (n > 0 && !(n % 1)) {
  let factorial = 1;
  for (let i = 1; i <= n; i++) {
    factorial *= i;
  }
  alert(factorial);
} else alert("Введено не натуральне число");

// 👉 Завдання 2:
// — Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

for (let i = 1000; i <= 9999; i += 3) document.write(`${i}, `);

// 👉 Завдання 3:
// — Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17…

for (let element = 1, count = 1; count <= 55; element += 2, count++) {
  document.write(`<p>Елемент № ${count} = ${element}<p/>`);
}

// 👉 Завдання 4:
// — Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60…

let str = "";
for (let i = 90; i >= 0; i -= 5) {
  str += i + " ";
}
document.write(str);

// 👉 Завдання 5:
// — Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128…

let str = "";
for (let element = 2, count = 1; count <= 20; element *= 2, count++) {
  str += element + " ";
}
document.write(str);

// 👉 Завдання 6:
// — Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), де початкове значення a = 2 та які менше 10000.

let str = "";
for (let a = 2; a < 10000; a = 2 * a - 1) {
  str += a + " ";
}
document.write(str);

// 👉 Завдання 7:
// — Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника),
//де початкове значення змінної a = -166.

let str = "";
for (let a = -166; a < 100; a = 2 * a + 200) {
  if (a > -100) str += a + " ";
}
document.write(str);

// 👉 Завдання 8:
// — Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0. Обрахувати всі можливі варіанти циклом for. Задачу бажано виконати використовуючи 1 цикл!
// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1; */

//Варіант 1
let a = +prompt("Введіть число"),
  b = +prompt("Введіть степінь"),
  result = 1,
  condition = b;

if (b < 0) condition = -b;

for (let i = 1; i <= condition; i++) {
  result *= a;
  if (b < 0 && i == condition) result = 1 / result;
}
console.log(result);

//Варіант 2
let a = +prompt("Введіть число"),
  b = +prompt("Введіть степінь"),
  result = 1;
for (let i = 0; i != b; ) {
  result *= a;
  if (b > 0) i++;
  else i--;
  if (b < 0 && i == b) result = 1 / result;
}
console.log(result);
